#+title: Perl Quick Reference
#+date: <2023-11-13 Mon 15:44>
#+hugo_lastmod: <2023-11-14 Tue 09:26>
#+hugo_tags: perl linux text_processing
#+setupfile: ./setup.conf

** Line matching (grep)
#+begin_src bash
cat <<EOF | perl -lne 'print if /sshd/'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
Jun 15 12:12:34 combo sshd(pam_unix)[23397]: authentication failure; logname= uid=0 euid=0 tty=NODEVssh ruser= rhost=218.188.2.4
#+end_example

** Print matched only (grep)
#+begin_src bash
cat <<EOF | perl -lne '/(pam_unix)/ and print $1'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
pam_unix
pam_unix
pam_unix
#+end_example

** Substitution (sed)
#+begin_src bash
cat <<EOF | perl -lpe 's/^Jun/Aug/'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
Aug 15 04:06:18 combo su(pam_unix)[21416]: session opened for user cyrus by (uid=0)
Aug 15 04:06:20 combo logrotate: ALERT exited abnormally with [1]
Aug 15 04:12:42 combo su(pam_unix)[22644]: session opened for user news by (uid=0)
Aug 15 12:12:34 combo sshd(pam_unix)[23397]: authentication failure; logname= uid=0 euid=0 tty=NODEVssh ruser= rhost=218.188.2.4
#+end_example

** Substitute on matches (awk)
#+begin_src bash
cat <<EOF | perl -lne '/uid=0/ and s/cyrus/foobar/ and print'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
Jun 15 04:06:18 combo su(pam_unix)[21416]: session opened for user foobar by (uid=0)
#+end_example

** Actions on pipe begin and end (awk)
#+begin_src bash
cat <<EOF | perl -lne 'BEGIN { print "Pipe begins!"; } END { print "Pipe ends!"; } print "2023 $_"'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
Pipe begins!
2023 Jun 15 04:06:18 combo su(pam_unix)[21416]: session opened for user cyrus by (uid=0)
2023 Jun 15 04:06:20 combo logrotate: ALERT exited abnormally with [1]
2023 Jun 15 04:12:42 combo su(pam_unix)[22644]: session opened for user news by (uid=0)
2023 Jun 15 12:12:34 combo sshd(pam_unix)[23397]: authentication failure; logname= uid=0 euid=0 tty=NODEVssh ruser= rhost=218.188.2.4
Pipe ends!
#+end_example

** Splitting (cut)
By default Perl splits by spaces.

#+begin_src bash
cat <<EOF | perl -lane 'print $F[4]'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
su(pam_unix)[21416]:
logrotate:
su(pam_unix)[22644]:
sshd(pam_unix)[23397]:
#+end_example

Specify patterns.

#+begin_src bash
cat <<EOF | perl -F':' -lane 'print $F[3]'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
 session opened for user cyrus by (uid=0)
 ALERT exited abnormally with [1]
 session opened for user news by (uid=0)
 authentication failure; logname= uid=0 euid=0 tty=NODEVssh ruser= rhost=218.188.2.4
#+end_example

** Transformation (tr)
#+begin_src bash
cat <<EOF | perl -lpe 'tr/a-z/A-Z/'
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
JUN 15 04:06:18 COMBO SU(PAM_UNIX)[21416]: SESSION OPENED FOR USER CYRUS BY (UID=0)
JUN 15 04:06:20 COMBO LOGROTATE: ALERT EXITED ABNORMALLY WITH [1]
JUN 15 04:12:42 COMBO SU(PAM_UNIX)[22644]: SESSION OPENED FOR USER NEWS BY (UID=0)
JUN 15 12:12:34 COMBO SSHD(PAM_UNIX)[23397]: AUTHENTICATION FAILURE; LOGNAME= UID=0 EUID=0 TTY=NODEVSSH RUSER= RHOST=218.188.2.4
#+end_example

** Remove duplicated lines (uniq)
#+begin_src bash
cat <<EOF | perl -lne 'print unless $a{$_}++'
<<log_stream>>
<<log_stream>>
EOF
#+end_src

#+RESULTS:
#+begin_example
Jun 15 04:06:18 combo su(pam_unix)[21416]: session opened for user cyrus by (uid=0)
Jun 15 04:06:20 combo logrotate: ALERT exited abnormally with [1]
Jun 15 04:12:42 combo su(pam_unix)[22644]: session opened for user news by (uid=0)
Jun 15 12:12:34 combo sshd(pam_unix)[23397]: authentication failure; logname= uid=0 euid=0 tty=NODEVssh ruser= rhost=218.188.2.4
#+end_example

** Subroutine (Function)
Subroutines in Perl just like shell functions where the parameter can be omitted and accessed by the default array =@_=.

To invoke a subroutine, use either =foo 1, 2, 3;= or =foo(1, 2, 3);=.  Note that the former one needs comma to delimit arguments (not space!)

#+begin_src perl
sub foo {
    my ($para1, $para2) = @_;
    # Or
    # my $para1 = shift;
    # my $para2 = shift;
    # Or (not preferred)
    # my $para1 = @_[0], $para2 = @_[1];
    print "Parameter1: $para1, Parameter2: $para2";
}

foo("hello", "world");
#+end_src

#+RESULTS:
#+begin_example
Parameter1: hello, Parameter2: world
#+end_example

The subroutines can actually be defined with explicit parameters so that the number of parameters will be checked.

#+begin_src perl
use 5.36.0;
# or
# use feature 'signatures';

sub foo($a, $b) {
    return $a + $b;
}

print foo(1, 2);
#+end_src

#+RESULTS:
#+begin_example
3
#+end_example

Variadic parameter is also supported.

#+begin_src perl
use 5.36.0;
# or
# use feature 'signatures';

sub foo($a, $b, @c) {
    my $sum = $a + $b;
    for (@c) {
        $sum += $_;
    }
    return $sum;
}

print foo(1, 2, 3..10);
#+end_src

#+RESULTS:
#+begin_example
55
#+end_example

In Perl 5, a new syntax was introduced, where the subroutine can be invoked with a =&= prefix, like =&foo(1, 2, 3)=.  This syntax can be ignored in most cases since it doesn't bring much benefit but confusion.  A noticeable difference is with this syntax the subroutine can access caller's =@_=.

#+begin_src perl
sub foo {
    print "aha @_\n";
}

@_ = ("foo", "bar");
foo;
foo();
&foo;
&foo();
#+end_src

#+RESULTS:
#+begin_example
aha
aha
aha foo bar
aha
#+end_example

*** Pass over references
Use =\= to reference a variable/subroutine.

Note that on the binder end (the =test= subroutine), the reference variables must be scalars (because they are references which make sense).  For the function call, the =->= operator is used to dereference (similar with C).

#+begin_src perl
$scalar = "foo";
@array = (1, 2, 3);
%hash = (foo => "foo1", bar => "bar1");
sub func { print "called func"; }

sub test {
    my ($s, $aref, $href, $fref) = @_;
    print "Scalar: $s";
    print "\nArray: ";
    print "$_, " for @$aref;
    print "\nHash: ";
    print "$_ => $hash{$_}, " for keys %$href;
    print "\n";
    $fref->();
}

test $scalar, \@array, \%hash, \&func;
#+end_src

#+RESULTS:
#+begin_example
Scalar: foo
Array: 1, 2, 3,
Hash: foo => foo1, bar => bar1,
called func
#+end_example

Also note that array and hash variables must be passed by reference if they are intended to be used as it.  Otherwise they will be slurped into the positional parameters.

#+begin_src perl
sub want_array {
    my ($a, $bref) = @_;
    print "Parameter a is: $a";
    print "\nArray ref is: $bref";
    print "\nThe rest: ";
    print "$_, " for @_;
    print "\n";
}

my @array = (1, 2, 3);

print "Passing by refenrence\n";
want_array("foo", \@array);

print "Passing by value\n";
want_array("foo", @array);
#+end_src

#+RESULTS:
#+begin_example
Passing by refenrence
Parameter a is: foo
Array ref is: ARRAY(0x116b140)
The rest: foo, ARRAY(0x116b140),
Passing by value
Parameter a is: foo
Array ref is: 1
The rest: foo, 1, 2, 3,
#+end_example

*** Convert to reference
Sometimes functions like =grep= and =map= return an arry or hash but a reference is needed.  The following example shows the usage of =Data::Dumper= where a reference to an array/a hash is neede.

#+begin_src perl
use Data::Dumper "Dumper";

print "Traditional way of doing it: referencing from variables.\n";
my @a = grep { $_ % 2 } 1..10;
my %b = map { $_ => "foo" } 1..5;
print Dumper(\@a);
print Dumper(\%b);

print "Convert to references in place.\n";
print Dumper([ grep { $_ % 2 } 20..30 ]);
print Dumper({ map { $_ => "bar" } 20..25 });
#+end_src

#+RESULTS:
#+begin_example
Traditional way of doing it: referencing from variables.
$VAR1 = [
          1,
          3,
          5,
          7,
          9
        ];
$VAR1 = {
          '5' => 'foo',
          '3' => 'foo',
          '4' => 'foo',
          '2' => 'foo',
          '1' => 'foo'
        };
Convert to references in place.
$VAR1 = [
          21,
          23,
          25,
          27,
          29
        ];
$VAR1 = {
          '21' => 'bar',
          '23' => 'bar',
          '20' => 'bar',
          '25' => 'bar',
          '22' => 'bar',
          '24' => 'bar'
        };
#+end_example

*** File handles
File handles are usually represented in barewords like =STDIN=, =STDOUT=, =STDERR=, etc..

When they need to be [[https://metacpan.org/dist/perl/view/pod/perlsub.pod#Pass-by-Reference][passed around]], one can use either bare typeglob or typeglob reference.

#+begin_src perl
use File::Temp "tempfile";

my ($fh, $fn) = tempfile(UNLINK => 1);
say $fh "line 1\nline 2\nline 3";
close $fh;

sub read_one_line {
    my $h = shift;
    print scalar readline($h);
}

sub open_read {
    my $fn = shift;
    local *fh; # Not my!
    open fh, "<", $fn or die "cannot open $fn";
    return *fh;
}

sub open_read_ref {
    my $fn = shift;
    my $fh;
    open $fh, "<", $fn or die "cannot open $fn";
    return $fh;
}

# Bareword file handle
print "Passing bareword file handle\n";
open FH, "<", $fn or die "cannot open $fn";
read_one_line(\*FH);
close FH;

print "Return tyepglob file handle\n";
my $FH1 = open_read($fn);
read_one_line($FH1);
close $FH1;

# Typeglob reference also works
print "Passing typeglob reference\n";
my $FH2;
open $FH2, "<", $fn or die "cannot open $fn";
read_one_line($FH2);
close $FH2;

print "Return typeblob reference\n";
my $FH3;
$FH3 = open_read_ref($fn);
read_one_line($FH3);
close $FH3;
#+end_src

#+RESULTS:
#+begin_example
Passing bareword file handle
line 1
Return tyepglob file handle
line 1
Passing typeglob reference
line 1
Return typeblob reference
line 1
#+end_example

*** Anonymous array
The anonymous array construction returns a reference.  Note that the square brackets =[]= are used here.

#+begin_src perl
my $aref = [1, 2, 3];
print "$_, " for @$aref;
#+end_src

#+RESULTS:
#+begin_example
1, 2, 3,
#+end_example

*** Anonymous hash
The anonymous hash construction returns a reference.  Note that the curly brackets ={}= are used here.

#+begin_src perl
my $href = {
    foo => "foovalue",
    bar => "barvalue"
};

while (my ($k, $v) = each %$href) {
    print "$k => $v, ";
}
#+end_src

#+RESULTS:
#+begin_example
bar => barvalue, foo => foovalue,
#+end_example

*** Anonymous subroutine
The anonymous subroutine construction returns a reference.  Note that no name is specified here and =->= operator are used to invoke the call.

#+begin_src perl
my $sref = sub { print "Called subroutine @_[0]"; };
$sref->("wow");
#+end_src

#+RESULTS:
#+begin_example
Called subroutine wow
#+end_example

** Lexical binding
Use keyword =my=.

#+begin_src perl
my $foo = "foo";
{
    my $foo = "FOO";
    print "Inside: $foo\n";
}
print $foo;
print "outside: $foo\n";
#+end_src

#+RESULTS:
#+begin_example
Inside: FOO
foooutside: foo
#+end_example

** Variable shadowing
Use keyword =local=.

#+begin_src perl
sub foo {
    print "In foo: $bar\n"; # Access a free variable
}

$bar = "bar";

{
    local $bar = "BAR";
    print "In block: $bar\n";
    foo($bar);
}

print "Out of block: $bar\n";
foo($bar);
#+end_src

#+RESULTS:
#+begin_example
In block: BAR
In foo: BAR
Out of block: bar
In foo: bar
#+end_example

** String interpolation
Similar with shell scripts.  =.= can be used to concatenate strings.

#+begin_src perl
my $foo = "foo", $bar = "bar";
print "Hello $foo $bar! Hey ${foo}-${bar}\n";
print "This " . $foo . " also works with " . $bar . "!\n";
#+end_src

#+RESULTS:
#+begin_example
Hello foo bar! Hey foo-bar
This foo also works with bar!
#+end_example

